NextFOAM-2409/tutorials/multiphase/interIsoFoam/notchedDiscInSolidBodyRotation/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

application=$(getApplication)

restore0Dir

runApplication blockMesh

runApplication -s postProcess ${application} -postProcess -time 0

runApplication setAlphaField

runApplication setFields

runApplication ${application}

#------------------------------------------------------------------------------
